## 1. Missing Data in Pandas

#### 1.1 None: Pythonic missing data

The first sentinel value used by Pandas is **None**.  Because it is a **Python object**, **None** cannot be used in any **arbitrary NumPy/Pandas array**, but only in arrays with data type **'object'**.

In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

This kind of **object array** is useful for **some purposes**, any **operations** on the data will be done at the **Python level**, with much more **overhead** than the **typically fast operations** seen for arrays with native types:

In [3]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
80.6 ms ± 1.03 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.01 ms ± 17.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

The use of **Python objects** in an array also means that if you perform **aggregations** like **sum() or min()** across an array with a None value, you will generally get an error:

In [4]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

This reflects **the fact that** addition between **an integer** and **None** is **undefined**.

#### 1.2 NaN: Missing numerical data

In [5]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

You should be aware that **NaN** is **a bit** like **a data virus–it** infects any other object it **touches**. Regardless of the operation, the result of **arithmetic** with **NaN** will be another NaN:

In [6]:
1 + np.nan

nan

In [7]:
0 *  np.nan

nan

Note that **this means** that aggregates over the **values** are **well defined** (i.e., they don't result in an error) but not always useful:

In [8]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

NumPy does provide some **special aggregations** that will ignore these **missing values**:

In [9]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

#### 1.3 NaN and None in Pandas

**NaN** and **None** both have **their place**, and **Pandas** is built to handle the two of them nearly interchangeably, converting between them where appropriate:

In [10]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don't have an **available sentinel value**, Pandas automatically **type-casts** when **NA values** are present. For example, if we set a value in an **integer array** to **np.nan**, it will automatically be upcast to a **floating-point type** to accommodate the **NA**:

In [11]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [12]:
# From int64 to float64
x[0] = None
x

0    NaN
1    1.0
dtype: float64

Notice that in addition to casting the **integer array** to **floating point**, Pandas automatically converts the **None** to a **NaN value**. (Be aware that there is a proposal to add a native integer NA to Pandas in the future; as of this writing, it has not been included).

**Typeclass	Conversion** When Storing NAs	NA Sentinel Value


**floating**	No change	**np.nan**


**object**	No change	**None or np.nan**


**integer**	Cast to **float64	np.nan**


**boolean**	Cast to **object	None or np.nan**

## 2 Operating on Null Values

**isnull()**: Generate a **boolean mask** indicating **missing values**
    
    
**notnull()**: Opposite of **isnull()**
    
    
**dropna()**: Return a **filtered version** of the data
    
    
**fillna()**: Return a copy of the data with **missing values** filled or imputed

#### 2.1 Detecting null values

In [14]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [15]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

**Boolean masks** can be used directly as **a Series** or **DataFrame index**:

In [16]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### 2.2 Dropping null values

**dropna()** (which removes NA values) and **fillna()** (which fills in NA values).

In [17]:
data.dropna()

0        1
2    hello
dtype: object

For a **DataFrame**, there are **more options**. Consider the following DataFrame:

In [18]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

We cannot drop **single values** from a DataFrame; we can only drop **full rows** or **full columns**. Depending on the application, you might want one or the other, so **dropna()** gives a number of options for a **DataFrame**.

By default, dropna() will drop **all rows**: in which any null value is present

In [19]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [20]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [21]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [22]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

For **finer-grained control**, the **thresh parameter** lets you specify a minimum number of **non-null** values for the **row/column** to be kept:

In [24]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

#### 2.3 Filling null values

You could do this in-place using the **isnull()** method as a mask, but because it is such **a common operation** Pandas provides the **fillna()** method, which returns **a copy of the array** with the null values replaced.

In [25]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

We can fill NA entries with **a single value**, such as **zero**:

In [26]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

We can specify a **forward-fill** to propagate the previous value forward:

In [27]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a **back-fill** to propagate the next values backward:

In [28]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For **DataFrames**, the options are similar, but we can also **specify** an axis along which **the fills take place**:

In [29]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [34]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [35]:
# rows
df.fillna(method='ffill', axis ='rows')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [36]:
# columns
df.fillna(method='ffill', axis ='columns')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0